import numpy as np
#Матрица цен (размер 2х3)
prices = np.array([[120, 230, 850] ])
#Вектор покупок (размер 3)
quantities = np.array([2, 1, 3])
#Умножаем Матрицу на Вектор с помощью оператора @
#Математика сделает это так:
#Магазин 1: (1002) + (2501) + (900*3) = 200 + 250 + 2700 = 3150
#Магазин 2: (1202) + (2301) + (850*3) = 240 + 230 + 2550 = 3020
total_costs = prices @ quantities
print("Итоговая стоимость корзины в каждом магазине:")
print(total_costs) 
print(f"Размер итогового массива: {total_costs.shape}")

d = np.array([[[1, 2, 3], [4, 5, 6]], [[7, 8, 9], [10, 11, 12]]])
print(d.shape) # Выведет: (2, 2, 3)