#Параметр self — это ссылка на текущий экземпляр класса.

#Используется для доступа к свойствам и методам, принадлежащим классу.
#Параметр self должен быть первым параметром любого метода в классе.
#Без self Python не узнает, к свойствам какого объекта вы хотите получить доступ:
#Ему не обязательно давать имя self, вы можете называть его как угодно, но это должен быть первый параметр любого метода в классе:
#class Person:
    #def __init__(myobject, имя, возраст):
        #myobject.name = имя
        #myobject.age = возраст

    #def greet"приветствие" (abc):
    #   print("Здравствуйте, меня зовут" + abc.name)

#p1 = Person ("Эмиль", 36)
#p1.greet()
#Хотя вы можете использовать другое имя, настоятельно рекомендуется использовать self так как это общепринятая практика в Python и делает ваш код более понятным для других.

class Car:
    def __init__(self,brand):
        self.brand = brand
    def show(self):
        self.brand
c1= Car("Ford")
c1.show()
